# -*- coding: utf-8 -*-
#题目：输入某年某月某日，判断这一天是这一年的第几天？ 
#程序分析：以3月5日为例，应该先把前两个月的加起来，然后再加上5天即本年的第几天，特殊情况，闰年且输入月份大于3时需考虑多加一天
data = input('请输入某年某月某日，例如：2017-12.10：')
s = data.split('-')
if(len(s) == 3):
     year =int(s[0])
     mon =s[1]
     day =s[2]
else:
   print('输入有误，请重新输入：')
da ={'1':0,'2':31,'3':59,'4':90,'5':120,'6':151,'7':181,'8':212,'9':243,'10':273,'11':304,'12':334}
def f(x):
    return da.get(x)
total = int(f(mon))+int (day)
if(year %400 == 0 or(year %4 == 0 and year %100 != 0)):
    if(mon>=3):
        total+=1
print(total)
     
